mefenemic-base/0/U.org
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0.010000 0 0))
            (0.1    (0.069091 0 0))
            (0.2    (-0.085611 0 0))
            (0.3    (0.105611 0 0))
            (0.4    (-0.049091 0 0))
            (0.5    (0.010000 0 0))
            (0.6    (0.069091 0 0))
            (0.7    (-0.085611 0 0))
            (0.8    (0.105611 0 0))
            (0.9    (-0.049091 0 0))
            (1.0    (0.010000 0 0))
            (1.1    (0.069091 0 0))
            (1.2    (-0.085611 0 0))
            (1.3    (0.105611 0 0))
            (1.4    (-0.049091 0 0))
            (1.5    (0.010000 0 0))
            (1.6    (0.069091 0 0))
            (1.7    (-0.085611 0 0))
            (1.8    (0.105611 0 0))
            (1.9    (-0.049091 0 0))
            (2.0    (0.010000 0 0))
            (2.1    (0.069091 0 0))
            (2.2    (-0.085611 0 0))
            (2.3    (0.105611 0 0))
            (2.4    (-0.049091 0 0))
            (2.5    (0.010000 0 0))
            (2.6    (0.069091 0 0))
            (2.7    (-0.085611 0 0))
            (2.8    (0.105611 0 0))
            (2.9    (-0.049091 0 0))
            (3.0    (0.010000 0 0))
        );
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
}// ************************************************************************* //