mefenemic-base/system/scalarTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Solves a transport equation for a scalar field.

    The name of the scalar field is specified in this file.  A sample scalar
    field file, that must be initialised for the case, typically in the 0
    directory, is available in $FOAM_ETC/caseDicts/solvers/scalarTransport.

\*---------------------------------------------------------------------------*/

#includeEtc     "caseDicts/postProcessing/solvers/scalarTransport/scalarTransport.cfg"

field           s;
schemesField    U;
D               1e-10;

// ************************************************************************* //
